{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Imaginarium of Jen Drakoj Blog",
    "home_page_url": "https://jen-drakoj.github.io/blog",
    "description": "The Imaginarium of Jen Drakoj Blog",
    "items": [
        {
            "id": "https://jen-drakoj.github.io/blog/rogue-squadron",
            "content_html": "<p>I finished reading <a href=\"https://starwars.fandom.com/wiki/X-Wing:_The_Bacta_War\" target=\"_blank\" rel=\"noopener noreferrer\">The Bacta War</a>, the fourth entry in the <a href=\"https://starwars.fandom.com/wiki/Star_Wars:_X-Wing_(novel_series)\" target=\"_blank\" rel=\"noopener noreferrer\">Star Wars: X-wing</a> book series and final entry in the <strong>Rogue Squadron</strong> tetralogy (the rest of the series focuses in <strong>Wraith Squadron</strong> instead).</p>\n<p>I had a blast reading the <a href=\"https://en.wikipedia.org/wiki/Thrawn_trilogy\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Thrawn</em> trilogy</a>.\nDespite not being perfect, they read like a plausible continuation to the original trilogy of movies.\nThe characters were overall well written and the main villain felt threatening and interesting.</p>\n<p>The <em>Rogue Squadron</em> books, on the other hand, felt more like a chore to read and were cringey quite often.</p>\n<!-- -->\n<p>I grew fond of most of the main characters over the books, which was a bit of a relief.\n<a href=\"https://starwars.fandom.com/wiki/Corran_Horn/Legends\" target=\"_blank\" rel=\"noopener noreferrer\">Corran Horn</a> in particular, started as an unlikeable character but got better starting the second book.</p>\n<p>The villains, however, were a huge disappointment.\nSeveral chunks of the books (to a greater or lesser degree, depending on the book) are spent from their point of view and fail miserably in every possible aspect.</p>\n<p>The writing was also a lackluster.\nCharacters don't speak like normal people, refer multiple times to known characters by full name.\nI stopped counting the times wherever characters would say things that were clearly written to be analogues to sayings used in the real world – surprisingly enough, most of them referred to Hutts.</p>\n<p>I was really excited to read these books because I grew up with <a href=\"https://en.wikipedia.org/wiki/Star_Wars:_Rogue_Squadron_(series)\" target=\"_blank\" rel=\"noopener noreferrer\">the Rogue Squadron videogames</a> and I love <em>Star Wars</em> ships.\nI was even more excited coming into the books, having seen a famous fan-made video that was released 2 years ago:</p>\n<div class=\"youtube_0t2M\"><iframe data-testid=\"youtube\" title=\"youTube-urAnFZBx7rE\" src=\"https://www.youtube-nocookie.com/embed/urAnFZBx7rE?&amp;autoplay=false&amp;start=0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"100%\" height=\"360\"></iframe></div>\n<p>Now, not everything was bad.\nFor once, it was interesting exploring the <em>Star Wars</em> universe with characters other than the main trio.\nAs I said, I grew fond of Corran and I'm interested in continuing his adventures once I start reading <a href=\"https://starwars.fandom.com/wiki/I,_Jedi\" target=\"_blank\" rel=\"noopener noreferrer\">I, Jedi</a>.</p>\n<p>There also quite a few exchanges of dialogue that caught my attention, such as:</p>\n<blockquote>\n<p>Pacifism for the sake of pacifism is the height of arrogant selfishness when that belief prevents you from acting to save others from harm.</p>\n</blockquote>\n<p>If I had to pick, I'd say that my favorite book was <a href=\"https://starwars.fandom.com/wiki/X-Wing:_Wedge%27s_Gamble\" target=\"_blank\" rel=\"noopener noreferrer\">Wedge's Gamble</a>:</p>\n<ul>\n<li>In the first book, <a href=\"https://starwars.fandom.com/wiki/X-Wing:_Rogue_Squadron\" target=\"_blank\" rel=\"noopener noreferrer\">Rogue Squadron</a>, the characters were not as likeable and the stakes were not really high.</li>\n<li>The third entry, <a href=\"https://starwars.fandom.com/wiki/X-Wing:_The_Krytos_Trap\" target=\"_blank\" rel=\"noopener noreferrer\">The Krytos Trap</a>, focused too much in trials and lawyering, and featured a very underwhelming escape from what should probably be the most secured place in the galaxy.</li>\n<li>The fourth entry, <em>The Bacta War</em>, failed to conclude the story in a satisfactory manner.\nNothing interesting happens and most character development had already happened in previous books.</li>\n</ul>\n<p>All in all, these are average books that I'd probably would have either skipped or stopped reading, if they weren't related to <em>Star Wars</em>.</p>",
            "url": "https://jen-drakoj.github.io/blog/rogue-squadron",
            "title": "Star Wars: X-wing – Rogue Squadron",
            "summary": "I finished reading The Bacta War, the fourth entry in the Star Wars: X-wing book series and final entry in the Rogue Squadron tetralogy (the rest of the series focuses in Wraith Squadron instead).",
            "date_modified": "2024-01-31T00:00:00.000Z",
            "author": {
                "name": "Jen Drakoj",
                "url": "https://github.com/jen-drakoj"
            },
            "tags": [
                "hobbies",
                "reading",
                "review",
                "star wars"
            ]
        },
        {
            "id": "https://jen-drakoj.github.io/blog/mi-lernas-esperanton",
            "content_html": "<p>A few years ago, I learned about the existence of <a href=\"https://en.wikipedia.org/wiki/Constructed_language\" target=\"_blank\" rel=\"noopener noreferrer\">constructed languages</a> or <em>conlangs</em>, for short.\nShortly after, I discovered <a href=\"https://en.wikipedia.org/wiki/Esperanto\" target=\"_blank\" rel=\"noopener noreferrer\">Esperanto</a>, arguably the most popular and used <em>conlang</em> in the world.</p>\n<p>This is my second attempt at trying to learn the language, after I got sidetracked.</p>\n<p>So far, I have found the language very easy to come back to; Esperanto delivers on the promise of being very easy to learn.</p>\n<p>I'm currently using two tools as part of my learning process: <a href=\"https://www.duolingo.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Duolingo</a> and <a href=\"https://lernu.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Lernu!</a>.</p>\n<p>Out of the two, <strong>Lernu!</strong> is probably the tool I'd recommend the most to anyone trying to learn the language.\nIt can be a bit though to get into (it doesn't have the Pavlovian conditioning of Duolingo), but it actually teaches you the rules of the language.</p>\n<p><strong>Duolingo</strong>, on the other hand, is an OK tool to practice but not to learn.\nIt also lacks any kind of theoretical material (usually present at the beginning of each unit) and the (audio) quality of the audio exercises is uneven and almost amateurish.</p>\n<p>As such, I learn with Lernu! but practice with Duolingo.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"practicing-esperanto\">Practicing Esperanto<a href=\"https://jen-drakoj.github.io/blog/mi-lernas-esperanton#practicing-esperanto\" class=\"hash-link\" aria-label=\"Direct link to Practicing Esperanto\" title=\"Direct link to Practicing Esperanto\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"reading\">Reading<a href=\"https://jen-drakoj.github.io/blog/mi-lernas-esperanton#reading\" class=\"hash-link\" aria-label=\"Direct link to Reading\" title=\"Direct link to Reading\">​</a></h3>\n<p>I still haven't commit yet to reading long texts in Esperanto on my own; I have been limiting myself to the exercises provided by the tools I just mentioned.</p>\n<p>However, it is within my plans to read <a href=\"https://www.goodreads.com/book/show/36951498-zamenhof-autoro-de-esperanto\" target=\"_blank\" rel=\"noopener noreferrer\">Zamenhof, Autoro de Esperanto</a>, originally written in English but also available in Esperanto.\nThe book recounts the life of Ludovic Zamenhof, the creator of the language.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"listening\">Listening<a href=\"https://jen-drakoj.github.io/blog/mi-lernas-esperanton#listening\" class=\"hash-link\" aria-label=\"Direct link to Listening\" title=\"Direct link to Listening\">​</a></h3>\n<p>Aside from speaking, this is something I'm not much of either.\nHowever, I recently discovered (although I shouldn't be surprised) that there's actual music made in Esperanto.</p>\n<p>I try to hear it often while working, at least to get used to the way the language sounds.\nNot every song is a winner but, considering how niche the market is for Esperanto music, the surprise comes from from finding great tracks.</p>\n<iframe src=\"https://open.spotify.com/embed/playlist/78BTQGeN8nJzSjXmeBXixe?utm_source=generator\" width=\"100%\" height=\"152\" frameborder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"writing\">Writing<a href=\"https://jen-drakoj.github.io/blog/mi-lernas-esperanton#writing\" class=\"hash-link\" aria-label=\"Direct link to Writing\" title=\"Direct link to Writing\">​</a></h3>\n<p>One of the reasons why I decided to start writing more was to also practice my Esperanto.\nIn the future, I wish to be able to write quality material to help nurture the language in my own way.</p>\n<p>In the meantime, I'm experimenting with using <a href=\"https://chat.openai.com/\" target=\"_blank\" rel=\"noopener noreferrer\">ChatGPT</a> to simulate having someone I can dialogue with and who can correct me.\nSo far, the experience hasn't been perfect (I've been only using version 3.5), but it is a great starting point.\nMy approach is to have the AI open up with a question, which I would then answer to, and then provide me feedback on my answer and continue with either a follow-up question or a new topic (if relevant).\nThis approach allows me to have a coherent conversation, instead of just answering a bunch of unrelated questions.</p>\n<p>Now, there's one thing I need to mention about practice writing Esperanto in a digital medium.</p>\n<p>The language contains a handful of special, non-ASCII characters: <code>ĉ</code>, <code>ĝ</code>, <code>ĥ</code>, <code>ĵ</code>, <code>ŝ</code> and <code>ŭ</code>; some of them unique to the language even.\nThis means that most keyboard layouts (especially the standard English ones) won't suffice.</p>\n<p>On Android this posed no problem, I only had to install the Esperanto module for my keyboard of choice, <a href=\"https://www.microsoft.com/en-us/swiftkey\" target=\"_blank\" rel=\"noopener noreferrer\">Swiftkey</a> — ten out of ten, would recommend.</p>\n<p>Windows, on the other hand, is a whole different beast.\nIt either requires jumping through hoops, just to add support as if you were trying to write in other mainstream languages, such as French.</p>\n<p>The international English keyboard can be used to input some non-ASCII characters, such as <code>á</code>, <code>å</code> and <code>ã</code>, but it is useless for Esperanto.\nThe easiest solution I have found so far is using <a href=\"https://apps.microsoft.com/detail/XP89DCGQ3K6VLD\" target=\"_blank\" rel=\"noopener noreferrer\">Microsoft's PowerToys</a>, which includes a bunch of nifty tools, including one called <strong>Quick Accent</strong>.\nThis tool provides an ok-ish way to type accented characters; it isn't perfect (at least not as perfect as using <code>AltGr + &lt;key&gt;</code> on the keyboard), but it is better than the hacks I found online.</p>\n<p>From what I have been able to read so far, the experience is less cumbersome for other OSes, such as GNU/Linux.</p>",
            "url": "https://jen-drakoj.github.io/blog/mi-lernas-esperanton",
            "title": "Mi lernas Esperanton",
            "summary": "A few years ago, I learned about the existence of constructed languages or conlangs_, for short.",
            "date_modified": "2024-01-29T00:00:00.000Z",
            "author": {
                "name": "Jen Drakoj",
                "url": "https://github.com/jen-drakoj"
            },
            "tags": [
                "hobbies",
                "learning",
                "esperanto"
            ]
        },
        {
            "id": "https://jen-drakoj.github.io/blog/fantastical-multiverse",
            "content_html": "<blockquote>\n<p>\"A long time ago, in a galaxy far, far away...\"</p>\n</blockquote>\n<p>I like the idea of the <em>multiverse</em> in works of fiction, even if I must agree that it is <a href=\"https://tvtropes.org/pmwiki/pmwiki.php/Main/TheMultiverse\" target=\"_blank\" rel=\"noopener noreferrer\">a trope</a> that has been overused in pop culture.\nThe possibility of not being restricted to a single canon opens up the door to exploring alternative stories, using familiar faces.</p>\n<p>This is particularly powerful from the point of view of the fans.\nThe concept of the multiverse –at least the one used in fiction– technically enables fanfiction and headcanons to be as valid and real as the mainstream canon.\nIn a world of infinite possibilities there must surely be room for official and unofficial growth.</p>\n<p>However, this concept is usually married with the idea of being able to <em>explore</em> those other worlds.\nMore often than not, the characters are at least aware of the existence of other worlds, similar to theirs but not quite.</p>\n<p>There have been rumors of Disney working on a <strong>What if...?</strong> series for Star Wars, just like they <a href=\"https://en.wikipedia.org/wiki/What_If...%3F_(TV_series)\" target=\"_blank\" rel=\"noopener noreferrer\">previously did with Marvel</a>.\nThis is something that made me feel a bit uncomfortable.\nThe idea of the multiverse feels... mechanical, all those possibilities existing in parallel, all part of a higher-level canon, which for me kind of robs some of the magic out of it.</p>\n<p>The multiverse also sounds too sci-fi for my taste, whereas I'm on the camp that considers Star Wars as a fantasy with sci-fi elements just to spice it up – not define it!\nGiven the current Disney canon, I wouldn't be surprised if this alternate scenarios were justified with the <a href=\"https://starwars.fandom.com/wiki/World_Between_Worlds\" target=\"_blank\" rel=\"noopener noreferrer\">World Between Worlds</a>.</p>\n<p>After doing some thinking, I realized there's a way that would enable to benefit from the idea of the multiverse, while making it feel fantastical instead of sci-fi.</p>\n<p>Star Wars was essentially born out of Joseph Campbell's <a href=\"https://en.wikipedia.org/wiki/The_Hero_with_a_Thousand_Faces\" target=\"_blank\" rel=\"noopener noreferrer\">The Hero with a Thousand Faces</a>, nurtured by the many myths and stories that have accompanied humanity since a long, long time ago.\nAnd there lies the key to all of this: any story, canon or not, can be seen as an interpretation of an original, fundamental story that unfortunately has been lost to us.</p>\n<p>Myths in our current day and age are incomplete reconstructions of stories told in the past.\nSome are more complete than others, true, but all of them are full of holes and it has been up to future generations to fill in those gaps.\nMoreover, those stories are not even set in stone; each interpretation transforms them (for better or worse) in what has now become a long <a href=\"https://en.wikipedia.org/wiki/Chinese_whispers\" target=\"_blank\" rel=\"noopener noreferrer\">game of telephone</a>.\nThe myths as we know them are not the same as they used to be a thousand years ago.</p>\n<p>Armed with this framework, I am enabled to consume things that used to be canon in Star Wars (the Expanded Universe) and things that are the current canon (Sequel Trilogy, et al.), and decide what fits my own vision of what the story is.</p>\n<p>Disney is the curator/loremaster of their own interpretation.\nBut we, as fans, are now empowered to embrace or disregard the different interpretations, as a whole or only specific elements of them.\nOur own headcanon is just interpretation of the Star Wars story: one filled with the things that we like.</p>\n<p>With this mindset, there's no more such a thing as an singular official canon or even the possibility of parallel worlds.\nIt is not possible to jump from one to another, because each interpretation exists on its own.</p>\n<p>One (unknown) original story, but an infinite number of interpretations.</p>",
            "url": "https://jen-drakoj.github.io/blog/fantastical-multiverse",
            "title": "A fantastical alternative to the Multiverse",
            "summary": "\"A long time ago, in a galaxy far, far away...\"",
            "date_modified": "2024-01-27T00:00:00.000Z",
            "author": {
                "name": "Jen Drakoj",
                "url": "https://github.com/jen-drakoj"
            },
            "tags": [
                "star wars",
                "ideas"
            ]
        },
        {
            "id": "https://jen-drakoj.github.io/blog/docusaurus-park",
            "content_html": "<p>Committing to start a blog can be a bit daunting for several reasons.\nOne of them being where should that blog live in.</p>\n<p>I don't want to use third-party services, such as <strong>WordPress</strong>, <strong>Medium</strong>, <strong>Ghost</strong>, <strong>Blogger</strong>, etc.\nFor the most part, they are quite limited (e.g. support for mathematical equations, ease of use).\nFurthermore, you must choose to either go freemium or pay in order to have access to hosting or features.</p>\n<p>While <strong>WordPress</strong> and <strong>Ghost</strong> can be hosted on personal servers, there's the matter of having to pay for the virtual server.\nThis was one of the reasons why I chose <a href=\"https://pages.github.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>GitHub Pages</strong></a> for this site.</p>\n<p>With that matter settled, now I had to decide what platform to use to actually blog.\nI ended up picking <a href=\"https://docusaurus.io/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Docusaurus</strong></a> for a several of reasons:</p>\n<ul>\n<li>It uses plain text files written in <a href=\"https://www.markdownguide.org/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Markdown</strong></a>.</li>\n<li>It generates sites statically, making it lighter than other bloated alternatives, such as <strong>WordPress</strong>.</li>\n<li>It provides support for a blog and other types of pages.</li>\n<li>It is built in (and support creating content) using <a href=\"https://react.dev/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>React</strong></a>, which I have been interested in experimenting with.</li>\n<li>It has out-of-the-box support for <strong>GitHub Pages</strong>.</li>\n</ul>\n<p>I'm sure there are alternatives that can achieve the same, better.\nBut, for my needs, <strong>Docusaurus</strong> gets the job done – even if I'm not crazy about its UI yet.</p>\n<blockquote>\n<p>Dr. Grant, my dear Dr. Sattler, welcome... to Docusaurus Park.</p>\n</blockquote>",
            "url": "https://jen-drakoj.github.io/blog/docusaurus-park",
            "title": "Welcome to Docusaurus Park",
            "summary": "Committing to start a blog can be a bit daunting for several reasons.",
            "date_modified": "2024-01-21T00:00:00.000Z",
            "author": {
                "name": "Jen Drakoj",
                "url": "https://github.com/jen-drakoj"
            },
            "tags": [
                "site"
            ]
        },
        {
            "id": "https://jen-drakoj.github.io/blog/lets-jam",
            "content_html": "<blockquote>\n<p>I think it's time we blow this scene<br>\n<!-- -->Get everybody and the stuff together<br>\n<!-- -->Okay, three, two, one, let's jam!</p>\n</blockquote>\n<p>I have always had difficulties taking notes or writing down my thoughts.\nCall it hubris or just plain old laziness.</p>\n<p>But, in an attempt to get the hang of it, I decided to start exercising my writing muscle.</p>\n<p>I'm still not a 100% sure what the scope will be, though.\nI want to share the things that I learn, that I do, and, especially, that bring me happiness.</p>\n<p>This blog will help me record snapshots of me at a given time.\nMeanwhile, the <a href=\"https://jen-drakoj.github.io/archives\"><strong>Archives</strong></a> are meant for things that are atemporal, such as information about projects I'm working on.</p>\n<p>Will this be a great adventure? <em>The bones tell me... nothing</em>.</p>",
            "url": "https://jen-drakoj.github.io/blog/lets-jam",
            "title": "Let's Jam!",
            "summary": "I think it's time we blow this scene\\",
            "date_modified": "2024-01-20T00:00:00.000Z",
            "author": {
                "name": "Jen Drakoj",
                "url": "https://github.com/jen-drakoj"
            },
            "tags": [
                "site"
            ]
        }
    ]
}